# Задача 8: Требуется определить, можно ли от шоколадки размером n × m
# долек отломить k долек, если разрешается сделать один разлом по
# прямой между дольками (то есть разломить шоколадку на два
# прямоугольника).
# 3 2 4 -> yes 
# 3 2 1 -> no

# n = int(input('введите длину шокладки: '))
# m = int(input('введите ширину шокладки: '))
# k = int(input('сколько вы хотите отломить долек: '))


n = 3
m = 2
k = 4

if k < n * m and (k % n == 0 or k % m == 0):
    print(f'{n} {m} {k} -> yes')
else:
    print(f'{n} {m} {k} -> no')

n = 3
m = 2
k = 1

if k < n * m and (k % n == 0 or k % m == 0):
    print(f'{n} {m} {k} -> yes')
else:
    print(f'{n} {m} {k} -> no')

